KZ: dict[str, str] = {
    "/start": "👋 Сәлем! Мен, Infopedia-бот ҰБТға информатика пәнінен дайындыққа арналғанмын.\n"
    "📄 Командалармен танысу үшін /help командасын жіберіңіз.",
    "/help": "🤖 Мен, біздің арнайы жобамыз — Infopedia үшін әзірленген көмекші-ботпын.\n\n"
    "🎯 Біздің мақсатымыз — информатикадан ҰБТ-ға дайындықты айтарлықтай жеңілдету және осы таңдау пән бойынша жоғары нәтижелерге жетуге көмектесу.\n\n"
    "🛠️ Қазіргі уақытта біз әлі де әзірлеу кезеңіңдеміз, сондықтан функциялардың көпшілігі әлі іске асырылған жоқ, бірақ қазіргі таңда қолжетімді функциялар біздің өнімді сынау мақсатында сізге тегін ұсынылады. Пікіріңізді алуға қуаныштымыз!\n\n",
    "/help_admin": "🤖 Мен, біздің арнайы жобамыз — Infopedia үшін әзірленген көмекші-ботпын.\n\n"
    "🎯 Біздің мақсатымыз — информатикадан ҰБТ-ға дайындықты айтарлықтай жеңілдету және осы таңдау пән бойынша жоғары нәтижелерге жетуге көмектесу.\n\n"
    "🛠️ Қазіргі уақытта біз әлі де әзірлеу кезеңіңдеміз, сондықтан функциялардың көпшілігі әлі іске асырылған жоқ, бірақ қазіргі таңда қолжетімді функциялар біздің өнімді сынау мақсатында сізге тегін ұсынылады. Пікіріңізді алуға қуаныштымыз!\n\n"
    "⚙️ Жүйедегі рөліңіз <code>ADMIN</code> болып табылады, сондықтан сізге қолжетімді командалар кеңейтілген:\n\n"
    "/ban — пайдаланушыны бұғаттау\n"
    "/unban — пайдаланушыдан бұғатты алып тастау\n"
    "/stats — пайдаланушылардың әрекеттер статистикасын қарау\n"
    "/feedback — анықтама бойынша іздеу дәлдігі статистикасын қарау",
    "/stats": "📊 <b>Пайдаланушылардың әрекеттер статистикасы:</b>\n\n"
    "{info_rows}\n\n"
    "🕒 Осы уақытқа дейін пайдаланушылар жасаған әрекеттердің жалпы саны: {total_actions}",
    "/feedback": "📊 <b>Анықтама бойынша іздеу дәлдігінің статистикасы:</b>\n\n"
    "{info_rows}\n\n"
    "🕒 Сұраулардың жалпы саны: {total_queries}\n"
    "🎯 Жалпы дәлдік пайызы: {total_accuracy}",
    "/language": "🧧 Сізге ең қолайлы тілді таңдаңыз",
    "/find": "📚 Бұл функцияның көмегімен сіз өзіңізге қажетті терминнің анықтамасын таба аласыз.\n\n"
    "🪄 Оны істеу үшін төмендегі батырманы басыңыз.",
    "/start_description": "Ботпен диалогты бастау",
    "/help_description": "Біз туралы көбірек білу",
    "/stats_description": "Пайдаланушылардың әрекеттер статистикасын қарау",
    "/feedback_description": "Анықтама бойынша іздеу дәлдігі статистикасын қарау",
    "/ban_description": "Пайдаланушыны бұғаттау (user_id немесе username қажет етеді)",
    "/unban_description": "Пайдаланушыдан бұғатты алып тастау (user_id немесе username қажет етеді)",
    "empty_ban_answer": "❗ Пайдаланушының ID немесе @username енгізіңіз.",
    "incorrect_ban_arg": "⚠️ <b>Бұрыс формат.</b>\n\nКелесі түрде қолданыңыз: /ban <code>ID</code> немесе /ban <code>@username</code>",
    "already_banned": "❗ Пайдаланушы әлбетте бұғатталған!",
    "successfully_banned": "🔒 Пайдаланушы сәтті бұғатталды!",
    "no_user": "❗ Деректер қорында мұндай пайдаланушы жоқ!",
    "empty_unban_answer": "❗ Пайдаланушының ID немесе @username енгізіңіз.",
    "incorrect_unban_arg": "⚠️ <b>Бұрыс формат.</b>\n\nКелесі түрде қолданыңыз: /unban <code>ID</code> немесе /unban <code>@username</code>",
    "not_banned": "❗ Пайдаланушы әлбетте бұғатталмаған!",
    "successfully_unbanned": "🔓 Пайдаланушыдан бұғат сәтті түрде алынды!",
    "stats_were_not_found": "❌ Өкінішке орай пайдаланушылардың әрекеттер статистикасын алу жүзеге аспады.",
    "feedback_was_not_found": "❌ Анықтамасы бойынша іздеу дәлдігі туралы статистиканы ала алмадық.",
    "10": "👨🏻‍🎓 10 сынып",
    "11": "👨🏻‍🎓 11 сынып",
    "undefined": "🧌 Мектеп оқушысы емеспің",
    "ru": "🇷🇺 Орыс тілі",
    "kz": "🇰🇿 Қазақ тілі",
    "follow_button": "🔔 Жазылу",
    "check_membership_button": "⏳ Жазылымды тексеру",
    "term_search_forbidden": "❌ Кешіріңіз, бірақ сіз терминді атауы бойынша іздеу лимитіне жеттіңіз (қарапайым пайдаланушылар үшін айына {usage_limit} әрекет)\n\n"
    "💎 Бірақ сіз Спонсор болып, боттың функцияларын шектеусіз пайдалана аласыз!",
    "definition_search_forbidden": "❌ Кешіріңіз, бірақ сіз анықтаманы мағынасы бойынша іздеу лимитіне жеттіңіз (қарапайым пайдаланушылар үшін айына {usage_limit} әрекет)\n\n"
    "💎 Бірақ сіз Спонсор болып, боттың функцияларын шектеусіз пайдалана аласыз!",
    "random_term_forbidden": "❌ Кешіріңіз, бірақ сіз кездейсоқ термин туралы ақпарат алу лимитіне жеттіңіз (қарапайым пайдаланушылар үшін айына {usage_limit} әрекет)\n\n"
    "💎 Бірақ сіз Спонсор болып, боттың функцияларын шектеусіз пайдалана аласыз!",
    "search_button": "🔍 Терминді іздеу",
    "choose_search_type": "⚙️ Келесі терминді іздеу түрлерінің бірін таңданыз:\n\n"
    "🔍 Атауы бойынша - атын енгізу арқылы терминді табыңыз.\n"
    "🧭 По определению - жуық анықтамасын енгізу арқылы терминді табыңыз.\n\n"
    "💬 Сұрауыңыздан кейін бот термин туралы барлық ақпаратты, соның ішінде: оның барлық анықтамаларын және олар табылған бет және тақырыбын көрсетеді.\n\n"
    "🪄 Оны істеу үшін төмендегі тиісті батырмалардың бірін басыңыз.",
    "find_term_by_name_button": "🔍 Атауы бойынша",
    "find_term_by_definition_button": "🧭 Анықтамасы бойынша",
    "get_random_term_button": "🎲 Кездейсоқ термин",
    "repeat_search_definition_button": "🔁 Тағы бір рет көру",
    "await_definition_to_recognize": "🧭 Сіз терминді жуық анықтамасы енгізу арқылы табуды таңдадыңыз.\n\n"
    "✍🏻 Сіз іздеген терминнің жуық анықтамасын чатқа жазыңыз, ал біздің бот оны табуға тырысады",
    "awaiting_response": "⏳ Күте тұрыңыз...",
    "step_understanding": "🧠 Сұрауыңыды зерттеп жатырмын",
    "step_searching": "📚 Кітаптардың ішінен іздеп жатырмын",
    "step_clarifying": "🧩 Мағыналарды салыстырып жатырмын",
    "step_preparing": "✨ Жауапты ойлап жатырмын",
    "definition_was_not_found": "❌ Сіз жіберген анықтамаға ұқсас анықтама таба алмадық.",
    "definition_was_found": "✅ Сіз жіберген анықтамаға ұқсас анықтаманы табылды!",
    "definition_representation": "📌 <b>{term}</b>\n\n"
    "🔹 {text}\n\n"
    "📖 <b>Кітап:</b> {source}\n"
    "🔖 <b>Тақырып</b>: {topic}\n"
    "📄 <b>Бет</b>: {page}",
    "consider_definition": "Пікіріңізбен бөлісуіңізді сұраймыз — бот сіз іздеген анықтаманы таба алды ма?",
    "definition_was_exact_button": "✅ Иә, іздегенім табылды",
    "definition_was_not_exact_button": "❌ Жоқ, мен басқаны іздедім",
    "exact_definition_feedback": "🎉 Біздің бот сіз іздеген анықтаманы таба алғанына қуаныштымыз.\n\n"
    "💌 Пікіріңізге рахмет, ол біздің боттың дәлдігін жақсартуға көмектеседі.",
    "not_exact_definition_feedback": "💔 Бот тапқан анықтама сіз іздеген анықтамаға сәйкес болмағанына өкінеміз.\n\n"
    "💌 Пікіріңізге рахмет, ол біздің боттың дәлдігін жақсартуға көмектеседі.",
    "wrong_definition_length": "❌ Сұрауыңыз тым қысқа.\n\n"
    "📝 Келесі жолы не іздеп жатқаныңызды толығырақ сипаттап көріңіз. Сұрау кемінде 2 сөзден тұруы керек.",
    "suggestion_positive_reply_button": "✅ Иә, қалаймын",
    "suggestion_negative_reply_button": "❌ Жоқ, қаламаймын",
    "change_language_button": "🧧 Тілді ауыстыру",
    "get_informed_about_roles_button": "🔰 Рөлдермен танысу",
    "roles_info": "✨ Біздің ботта келесі рөлдер бар:\n\n"
    "👤 <b>Пайдаланушы — негізгі рөл</b>\n"
    "<i>Күнделікті іздеу лимиттерімен және дереккөздердің бір бөлігіне ғана қолжетімділікпен шектелген</i>\n\n"
    "💎 <b>Спонсор — премиум-статус</b>\n"
    "<i>Боттың барлық функцияларына шексіз қолжетімділік: барлық 15 кітап бойынша ақылды іздеу. Бұл — жобамызды қолдаудың және боттың барлық мүмкіндіктерін шектеусіз пайдаланудың тамаша жолы!</i>\n\n"
    "🔰 Қазіргі рөліңіз: {user_role}.",
    "buy_subscription_button": "💎 Спонсор атану",
    "buy_subscription_info": "✨ Спонсор мәртебесі — ең тиімді дайындыққа апаратын кілтің. Жобаны қолдай отырып, сен біздің ақылды глоссарийдің барлық мүмкіндіктерін ешқандай шектеусіз ашасың.\n\n"
    "🚀 Шектеусіз ақылды іздеу: Лимиттерді ұмыт. Кез келген күрделі тақырыпты немесе тест нұсқасын толық түсіну үшін анықтамаларды мағынасы бойынша қалағаныңша ізде.\n\n"
    "📚 Барлық 15 дереккөз: Информатика бойынша мектеп оқулықтарының барлығынан бірден толық жауаптар ал. Бұл сені ЕНТ-да кездесуі мүмкін әрбір тұжырымдамаға сенімді етеді.\n\n"
    "⚡️ Басымдық пен қолдау: Спонсорлар жаңа функцияларға бірінші болып қол жеткізеді, ал олардың сұраныстары басым тәртіпте өңделеді. Біз боттың дамуына қосқан үлесіңді жоғары бағалаймыз!\n\n"
    "💰 Жазылым құны: Айына бар болғаны <b>1 490 ₸</b>. Бұл информатикадан ЕНТ-ға дайындалуға арналған кез келген оқулықтан да арзан!",
    "confirm_buy_subscription_button": "💳 Төлемге өту",
    "confirm_buy_subscription_info": "📋 Төлем жасау жөніндегі нұсқаулық\n\n"
    "🔑 Спонсор мәртебесін белсендіру үшін көрсетілген картаға аударым жасаңыз:\n\n"
    "💳 Kaspi Bank: 4400 4303 0908 9750\n"
    "👤 Алушы: Гибрат К.\n"
    "💰 Сома: 1 490 ₸\n\n"
    "✅ Төлемнен кейін: Чек скриншотын осы чатқа жауап ретінде жіберіңіз.\n\n"
    "⏳ Белсендіру: Біздің администратор аударымды тексеріп, 12 сағат ішінде қолжетімділікті қосады. Сіз боттан хабарлама аласыз!",
    "subscription_receipt_received": "⏳ Төлем чегі қабылданды. Администратор аударымды тексеріп, 12 сағат ішінде қолжетімділікті белсендіргенше күте тұрыңыз.",
    "subscription_receipt_incorrect_format": "❌ Өтінеміз, чекті .pdf форматында жіберіңіз.",
    "back_to_profile_menu_button": "↩️ Профильге оралу",
    "save_language_button": "✅ Сақтау",
    "back_to_main_menu_button": "↩️ Басты мәзірге оралу",
    "language_saved": "🧧 Сіз таңдаған тіл: {user_language}\n\n"
    "📌 Болашақта бұл тіл бот интерфейсін көрсету үшін пайдаланылады!",
    "language_cancelled": "🧧 Жақсы, сіздің тіліңіз әлі: {user_language}\n\n"
    "📌 Бұл тіл бот интерфейсін көрсету үшін пайдаланылады.",
    "channel_membership": "🔔 Біздің ботты пайдалану үшін Telegram-каналымызға жазылу қажет.\n\n"
    "🚀 Бізге жазылу арқылы сіз біздің жобаны дамытуға көмектесесіз.",
    "successful_membership": "✅ Жазылуға тексеруден өттіңіз!",
    "unsuccessful_membership": "❌ Сіз әлі де тіркелмедіңіз!",
    "await_membership": "🔔 Біздің ботты пайдалануды бастамас бұрын, біздің Telegram-каналымызға жазылуыңыз қажет.",
    "choose_language": "🧧 Бот сізге жауап беретін тілді таңдауыңызды сұраймыз",
    "failed_to_await_membership": "🔗 <code>Жазылу</code> батырмасын басып, Telegram-каналымызға жазылыңыз.\n\n"
    "🚀 Сіздің жазылуыңыз біздің жоба үшін өте маңызды және онсыз біз жұмысымызды жалғастыра алмаймыз.",
    "choose_grade": "🧧 Сіз таңдаған тіл: {user_language}\n\n"
    "📌 Болашақта бұл тіл бот интерфейсін көрсету үшін пайдаланылады.\n\n"
    "🎓 Енді сіз қазіргі таңда оқып жатқан сыныбыңызды таңдаңыз.",
    "failed_to_choose_language": "🧧 Бот сізге жауап беретін тілді таңдауыңызды сұраймыз.\n\n"
    "🪄 Оны істеу үшін жоғарыдағы тиісті батырмалардың бірін басыңыз",
    "finish_registration": "🎓 Сіз таңдаған сынып: {user_grade}\n\n"
    "📌 Біз бұл деректерді статистика үшін жинаймыз.",
    "thanks_for_registration": "💌 Рахмет, барлық алдын ала баптаулар аяқталды және енді сіз біздің ботты еркін пайдалана аласыз!",
    "failed_to_choose_grade": "🎓 Қазіргі уақытта оқып жатқан сыныпты таңдауыңызды сұраймыз.\n\n"
    "🪄 Оны істеу үшін жоғарыдағы тиісті батырмалардың бірін басыңыз",
    "suggest_new_term": "❓ Сіз шынымен келесі терминді ұсынғыңыз келеді ме: <b>{term}</b>?",
    "suggestion_positive_reply": "📝 Сіз келесі терминді ұсындыңыз: <b>{term}</b>.\n\n"
    "❗ Бұл функцияны дұрыс пайдаланбау сіздің аккаунтті ботта бұғаттауға әкелуі мүмкін екенін ескеріңіз.",
    "get_term_info": "📌 <b>{term}</b>\n\n"
    "🔹 {text}\n\n"
    "🔖 <b>Тақырып</b>: {topic}\n"
    "📄 <b>Бет</b>: {page}\n",
    "term_was_not_found": "❌ Қате орын алды. Термин дерекқордан табылмады.",
    "term_presentation_error": "❌ Қате орын алды. Терминді көрсету мүмкін емес.",
    "noop_button": "Бұл батырма ештеңеге жауапты емес.",
    "back_button": "↩️ Артқа",
    "user": "👤 Пайдаланушы",
    "client": "💎 Спонсор",
    "admin": "⚙️ Администратор",
    "profile_menu_button": "👤 Профиль",
    "main_menu_button": "🏠 Главная",
    "profile_menu": "#️⃣  Профиль, {username}\n\n"
    "🧧 Таңдалынған тіл: {user_language}\n"
    "🔰 Рөл: {user_role}",
    "main_menu": "♨️ Информатикадан ҰБТ-ға дайындалуға арналған көмекші-бот, анықтамалары, беттері және тақырыптары бар терминдерді жылдам іздеу, тікелей Telegram-да ыңғайлы түрде білім алу.\n\n"
    '🔗 Біздің канал — <a href="https://t.me/infopedia_kz">Infopedia</a>\n'
    '💬 Біздің чат — <a href="https://t.me/+keAjEHF57gc3NWYy">Infopedia Chat</a>\n\n'
    "🧑🏻‍🎓 Боттағы пайдаланушылар саны: {total_users}\n"
    "📚 Боттағы терминдер саны: {total_terms}+\n"
    "🧠 Терминдерді интерактивты форматта бекітіңіз\n\n"
    "🔰 Рөл: {user_role}",
    "changing_menu": "⏳ Батырмалардың мәтінің қажетті тілге ауыстырып жатырмыз...",
}
