KZ: dict[str, str] = {
    "/start": "Сәлем! Мен, Infopedia-бот ҰБТға информатика пәнінен дайындыққа арналғанмын.\n"
              "Командалармен танысу үшін /help командасын жіберіңіз.",
    "/help": "Мен, біздің арнайы жобамыз - Infopedia үшін әзірленген көмекші-ботпын."
             "Біздің мақсатымыз – информатикадан ҰБТ-ға дайындықты айтарлықтай жеңілдету және осы таңдау пән бойынша жоғары нәтижелерге жетуге көмектесу.\n\n"
             "Қазіргі уақытта біз әлі де әзірлеу кезеңіңдеміз, сондықтан функциялардың көпшілігі әлі іске асырылған жоқ, бірақ қазіргі таңда қолжетімді функциялар біздің өнімді сынау мақсатында сізге тегін ұсынылады. Пікіріңізді алуға қуаныштымыз!\n\n"
             "Сізге қолжетімді командалар:\n\n"
             "/language - интерфейс тілін орнату\n"
             "/help - осы анықтаманы қарау",
    "/help_admin": "Мен, біздің арнайы жобамыз - Infopedia үшін әзірленген көмекші-ботпын."
                   "Біздің мақсатымыз – информатикадан ҰБТ-ға дайындықты айтарлықтай жеңілдету және осы таңдау пән бойынша жоғары нәтижелерге жетуге көмектесу.\n\n"
                   "Қазіргі уақытта біз әлі де әзірлеу кезеңіңдеміз, сондықтан функциялардың көпшілігі әлі іске асырылған жоқ, бірақ қазіргі таңда қолжетімді функциялар біздің өнімді сынау мақсатында сізге тегін ұсынылады. Пікіріңізді алуға қуаныштымыз!\n\n"
                   "Сізге қолжетімді командалар:\n\n"
                   "/language - интерфейс тілін орнату\n"
                   "/help - осы анықтаманы қарау\n"
                   "/ban - пайдаланушыны бұғаттау\n"
                   "/unban - пайдаланушыдан бұғатты алып тастау\n"
                   "/stats - пайдаланушылардың әрекеттер статистикасын қарау",
    "/language": "Сізге ең қолайлы тілді таңдаңыз",
    "/find": "Бұл функцияның көмегімен сіз өзіңізге қажетті терминнің анықтамасын таба аласыз.\n\n"
             "Оны істеу үшін төмендегі батырманы басыңыз.",

    "/start_description": "Ботпен диалогты бастау",
    "/help_description": "Біз туралы көбірек білу",
    "/language_description": "Интерфейс тілін ауыстыру",
    "/find_description": "Терминді кітаптан табу",
    "/ban_description": "Пайдаланушыны бұғаттау (user_id немесе username қажет етеді)",
    "/unban_description": "Пайдаланушыдан бұғатты алып тастау (user_id немесе username қажет етеді)",
    "/stats_description": "Пайдаланушылардың әрекеттер статистикасын қарау",

    "channel_subscription": "Бұл функцияны қолдану үшін сіз біздің Telegram-арнамызға тіркелу керексіз.",
    "successful_channel_subcription": "✅ Сіз тіркелуге байланысты тексеруден сәтті өттіңіз!",
    "unsuccessful_channel_subscription": "❌ Сіз әлі тіркелмедіңіз!",

    "grade_10": "10 сынып",
    "grade_11": "11 сынып",
    "grade_undefined": "Белгісіз",

    "ru": "🇷🇺 Орыс тілі",
    "kz": "🇰🇿 Қазақ тілі",
    "save_language_button_text": "✅ Сақтау",
    "cancel_language_button_text": "Болдырмау",
    "language_saved": "Сіз таңдаған тіл: {}\n"
                      "Болашақта бұл тіл бот интерфейсін көрсету үшін пайдаланылады!",
    "language_cancelled": "Жақсы, сіздің тіліңіз әлі: {}",

    "channel_membership": "Біздің ботты пайдалану үшін Telegram-каналымызға тіркелу қажет.\n\n"
                          "Бізге тіркелу арқылы сіз біздің жобаны дамытуға көмектесесіз.",
    "successful_membership": "✅ Тіркелуге тексеруден өттіңіз!",
    "unsuccessful_membership": "❌ Сіз әлі де тіркелмедіңіз!",
    "await_membership": "Біздің ботты пайдалануды бастамас бұрын, біздің Telegram-каналымызға тіркелуіңіз қажет.",
    "choose_language": "Бот сізге жауап беретін тілді таңдауыңызды сұраймыз",
    "failed_to_await_membership": "<code>Тіркелу</code> батырмасын басып, Telegram-каналымызға жазылыңыз.\n"
                                  "Сіздің тіркелуіңіз біздің жоба үшін өте маңызды және онсыз біз жұмысымызды жалғастыра алмаймыз.",
    "choose_grade": "Сіз таңдаған тіл: {}\n"
                    "Оны басты мәзірде кез келген уақытта өзгертуге болады.\n\n"
                    "Енді сіз қазіргі таңда оқып жатқан сыныбыңызды таңдаңыз.",
    "failed_to_choose_language": "Бот сізге жауап беретін тілді таңдауыңызды сұраймыз.\n"
                                 "Оны істеу үшін жоғарыдағы тиісті батырмалардың бірін басыңыз",
    "finish_registration": "Сіз таңдаған сынып: {}\n"
                           "Оны басты мәзірде кез келген уақытта өзгертуге болады.\n\n"
                           "Рахмет, барлық алдын ала параметрлерді анықтау аяқталды, енді сіз біздің ботты еркін пайдалана аласыз!",
    "failed_to_choose_grade": "Қазіргі уақытта оқып жатқан сыныпты таңдауыңызды сұраймыз.\n"
                              "Оны істеу үшін жоғарыдағы тиісті батырмалардың бірін басыңыз",

    "suggest_new_definition": "Сіз шынымен келесі терминді ұсынғыңыз келеді ме: <b>{}</b>?",
    "suggestion_positive_reply": "Сіз келесі терминді ұсындыңыз: <b>{}</b>.\n\n"
                                 "Бұл функцияны дұрыс пайдаланбау сіздің аккаунтті ботта бұғаттауға әкелуі мүмкін екенін ескеріңіз.",
    "get_term_info": "📌 <b>{}</b>\n\n"
                     "🔹 {}\n\n"
                     "🔖 <b>Тақырып</b>: {} | 📄 <b>Бет</b>: {}\n",

    "noop": "Бұл батырма ештеңеге жауапты емес."
}
